app/controllers/posts_controller.rb

  def index
    @posts = Post.all(:order => "created_at DESC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("Text", "created_at", "media", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Text", "Test Post Please ignore. "], ["created_at", Sun, 03 Nov 2013 18:04:32 UTC +00:00], ["media", ""], ["title", "New Post"], ["updated_at", Sun, 03 Nov 2013 18:04:32 UTC +00:00]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "posts" SET "Text" = 'Good morning, everybody. I want to talk this morning about social software ...there''s a surprise. I want to talk about a pattern I''ve seen over and over again in social software that supports large and long-lived groups. And that pattern is the pattern described in the title of this talk: "A Group Is Its Own Worst Enemy."